ezois_ka/oooezoiskaobmen/src/Documents/СверкаСДокументамиВоинскогоУчета/СверкаСДокументамиВоинскогоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СверкаСДокументамиВоинскогоУчета</name>
  <registerRecords>InformationRegister.ДанныеСверкиСДокументамиВоинскогоУчета</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СверкуПровел</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/Documents/СверкаСДокументамиВоинскогоУчета/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ЗаполнитьПоФизическомуЛицу(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляПроведения = ДанныеДляПроведения();
	СформироватьДвиженияСверки(Движения, ДанныеДляПроведения.ДанныеСверки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляПроведения()
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СверкаСДокументамиВоинскогоУчетаСотрудники.Ссылка.Дата КАК Период,
		|	СверкаСДокументамиВоинскогоУчетаСотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СверкаСДокументамиВоинскогоУчетаСотрудники.Ссылка.Организация КАК Организация,
		|	СверкаСДокументамиВоинскогоУчетаСотрудники.Ссылка.СверкуПровел КАК СверкуПровел
		|ИЗ
		|	Документ.СверкаСДокументамиВоинскогоУчета.Сотрудники КАК СверкаСДокументамиВоинскогоУчетаСотрудники
		|ГДЕ
		|	СверкаСДокументамиВоинскогоУчетаСотрудники.Ссылка = &Ссылка";
	
	ДанныеСверки = Запрос.Выполнить().Выгрузить();
	
	ДанныеДляПроведения = Новый Структура;
	ДанныеДляПроведения.Вставить("ДанныеСверки", ДанныеСверки);
	
	Возврат ДанныеДляПроведения;
	
КонецФункции

Процедура СформироватьДвиженияСверки(Движения, ДанныеСверки) Экспорт 
	
	Движения.ДанныеСверкиСДокументамиВоинскогоУчета.Записывать = Истина;
	Движения.ДанныеСверкиСДокументамиВоинскогоУчета.Загрузить(ДанныеСверки);
	
КонецПроцедуры

Процедура ЗаполнитьПоФизическомуЛицу(ФизическоеЛицо)
	
	ДатаСведений = ТекущаяДатаСеанса();
	ОсновныеСотрудники = КадровыйУчет.ОсновныеСотрудникиИнформационнойБазы(Истина, ФизическоеЛицо, ДатаСведений);
	
	Сотрудник = ОсновныеСотрудники[ФизическоеЛицо];
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат;
	КонецЕсли;
	
	КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудника(Истина, Сотрудник, "Организация", ДатаСведений); 
	Если КадровыеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Организация = КадровыеДанные.Организация;
	Сотрудники.Добавить().ФизическоеЛицо = ФизическоеЛицо;
	
	УстановитьПривилегированныйРежим(Истина);
	Пользователь = Пользователи.АвторизованныйПользователь();
	Если ТипЗнч(Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
		СверкуПровел = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ФизическоеЛицо");
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
